Repository: 84000/data-translation-memory
Catalog: toh186-v2.tmx
Source language: bo
Languages: en

source: ཟླ་བའི་དཀྱིལ་འཁོར་འདྲ་བ་དང་། །དེ་བཞིན་སྒྱུ་མ་བྱེད་པ་འདྲ། །
en: Like the orb of the moon, Like a conjurer,

source: འོང་བ་དང་ནི་འགྲོ་བ་ཡང་། །དེ་བཞིན་གཤེགས་པ་སྟོན་པར་མཛད། །
en: “The Tathāgata shows himself To come and go.

source: མཆོད་རྟེན་དང་ནི་རི་མོ་དང་། །སྐུ་གཟུགས་བྱེད་དུ་གཞུག་པ་དང་། །མཆོད་དང་བཀུར་སྟི་བྱ་བའི་ཕྱིར། །
en: Because they have stūpas, Drawings, and images made “And they honor and worship him,

source: གང་དག་མཚན་ནི་དྲན་བྱེད་པ། །བྱང་ཆུབ་ཕྱིར་ནི་གནས་པ་རྣམས། །ཐམས་ཅད་ཐར་པ་ཐོབ་པར་འགྱུར། །
en: Those who remember his name And live for the sake of awakening Will all attain liberation.

source: དེ་བཞིན་གཤེགས་ལ་ཕྱག་འཚལ་ནས། །
en: “Since they pay homage to the Tathāgata,

source: དམ་པའི་ཆོས་ནི་མཉན་པ་དང་། །མཆོད་ཅིང་འཛིན་པའང་དེ་བཞིན་ཏེ། །
en: Listen to the noble Dharma, And worship and retain it accordingly,

source: སྡུག་བསྔལ་ཀུན་ལས་གྲོལ་བར་འགྱུར། །
en: They will be free from all suffering.”

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་འདི་ཡང་དག་པར་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་དྲུག་ཁྲི་བཞི་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As the Tathāgata imparted this instruction on the sovereign power and the miracle of the extraordinary transformation of a tathāgata, sixty-four thousand beings reached the stage where they accepted that phenomena are not produced.

source: སྲོག་ཆགས་ཉི་ཁྲིས་ཆོས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་གོ། །
en: Twenty thousand beings completely purified the eye of Dharma that sees all phenomena.

source: ལྷའི་བུ་ལྔ་སྟོང་གིས་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: Five thousand gods remained without grasping, their minds freed from defilements.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་གྱུར་ཏོ། །
en: They were led to the stage of a non-returner.

source: དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་བདུན་བརྒྱས་ཏིང་ངེ་འཛིན་སྣ་ཚོགས་ཐོབ་པར་གྱུར་ཏོ། །
en: Seven hundred monks, nuns, and male and female lay vow holders attained various states of concentration.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: King Prasenajit said to the youthful Mañjuśrī,

source: རྒྱལ་བའི་སྲས་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་དྲིས་པའི་ལན་བཤད་པ་འདི་ནི་ཁྱོད་ཀྱིས་ལེགས་པར་བཤད་དེ་
en: “Son of the Victorious One, in your answers to the questions that were asked for the benefit of all beings, what you said was excellent,

source: ལེགས་མོད་ཀྱི།
en: it was excellent indeed.

source: ཁོ་བོ་ཐེ་ཙོམ་ཅུང་ཟད་ཅིག་སྐྱེས་ཀྱིས།
en: Yet I still have a few doubts.

source: གང་ཐོས་ནས་སེམས་ཅན་རྣམས་ཀྱིས་ཡིད་ལ་བྱས་ཏེ
en: which are about beings applying their minds to what they have heard and thus

source: དེ་དག་ཐམས་ཅད་འཁོར་བའི་སྡུག་བསྔལ་ལས་གྲོལ་བར་འགྱུར་བ་དང་། བདེ་འགྲོར་འགྲོ་བར་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བར་
en: becoming free from the suffering of saṃsāra, passing into fortunate forms of existence, and never falling back from unsurpassable, truly perfect awakening.”

source: ཁོ་བོས་དྲིས་པ་དེ་བསྟན་ཅིང་ལུང་སྟོན་ཅིག །
en: Therefore, please expound upon and answer my questions,

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied,

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྔོན་དགེ་བའི་རྩ་བ་སྐྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྤོབས་པ་སྐྱེས་པ་ནི་ལེགས་སོ། །
en: “Great king, it is excellent that you have developed your previous roots of merit and that your confidence has increased through the sovereign power of the Tathāgata.

source: ཁྱོད་གང་དང་གང་འདོད་པ་དྲིས་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །
en: Whatever you wish to know, ask and I shall explain it to you.”

source: སྨྲས་པ།
en: The king said,

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཚན་ཐོས་པ་ཙམ་དང་། མཆོད་པ་དང་། བཀུར་སྟི་བྱས་པ་ཉིད་ཀྱིས་སྡིག་པ་བྱེད་པའི་སེམས་ཅན་རྣམས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ལས་གྲོལ་བར་འགྱུར་ཞིང་བདེ་འགྲོར་འགྲོ་བར་འགྱུར་བ་
en: “Son of the Victorious One, just by hearing the names of the tathāgatas and honoring and serving them, beings who perform negative actions will be liberated from rebirths as denizens of the hells and animals, as well as from Yama’s world, and will pass into pleasant forms of existence.

source: དེ་དག་གང་ལགས།
en: Who are those beings?

source: དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་ནི་གང་ན་བཞུགས།
en: In which world system do they abide?

source: དེ་དག་ལ་མཆོད་པ་ནི་ཇི་ལྟར་བགྱི།
en: How should we honor them?”

source: རིགས་ཀྱི་བུ་གང་གི་ཕྱིར་སེམས་ཅན་རྣམས་ངན་སོང་དུ་འགྲོ་བར་མི་འགྱུར་བ་དང་། གང་ངན་སོང་དུ་སྐྱེས་པ་དེ་དག་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་བའི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་མཆོད་ཅིང་བསྟི་སྟང་བྱ་བ་བཤད་ཀྱིས་ཉོན་ཅིག །
en: “Son of noble family, listen. I shall elucidate the reason why these beings will not pass into negative forms of existence. I shall state the names of the blessed ones, the tathāgatas, who will liberate them from rebirths in negative forms of existence, from rebirths as denizens of the hells and animals, and from Yama’s world, and I shall state how they are to be worshipped and venerated in their respective world systems.

source: འཇིག་རྟེན་གྱི་ཁམས་བཻ་དཱུརྱ་སྣང་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་བླ་བཻ་དཱུརྱའི་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “In the world system called Vaiḍūrya Light abides the Tathāgata, the Arhat, the truly perfect Buddha called Bhaiṣajyaguru Vaidūryaprabharāja,

source: འཚོ་ལ་གཞེས་ཤིང་ཆོས་ཀྱང་སྟོན་པ་ཡོད་དོ། །
en: who watches over beings as well as teaches the Dharma.

source: འཇིག་རྟེན་གྱི་ཁམས་གཙུག་པུད་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་གཙུག་པུད་ཅན་ཞེས་བྱ་བ་ཡོད་དོ། །
en: In the world system called Śikhin abides the Tathāgata, the Arhat, the truly perfect Buddha called Śikhin.

source: འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པར་འབྱུང་བ་ཞེས་བྱ་བ་ཡོད་དོ། །
en: In the world system called Vimalā abides the Tathāgata, the Arhat, the truly perfect Buddha called Stainless Arising.

source: འཇིག་རྟེན་གྱི་ཁམས་ཞི་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རབ་ཏུ་ཞི་བར་བཀོད་པ་ཞེས་བྱ་བ་ཡོད་དོ། །
en: In the world system called Peace abides the Tathāgata, the Arhat, the truly perfect Buddha called Established in Peace.

source: འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་ཏུ་མེད་པ་ཞེས་བྱ་བ་དང་།
en: In the world system called Sukhāvatī abides the Tathāgata, the Arhat, the truly perfect Buddha called Amitābha.

source: འཇིག་རྟེན་གྱི་ཁམས་པད་མོའི་བླ་མ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོ་འབྱུང་བ་ཞེས་བྱ་བ་དང་།
en: In the world system called Lotus Excellence abides the Tathāgata, the Arhat, the truly perfect Buddha called Lotus Born.

source: འཇིག་རྟེན་གྱི་ཁམས་རྡོ་རྗེ་ན་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མཁྲེགས་པ་ཞེས་བྱ་བ་དང་།
en: In the world system called Vajra abides the Tathāgata called Indestructible Vajra.

source: འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་བྲལ་བ་ཞེས་བྱ་བ་དང་།
en: In the world system called Aśoka abides the Tathāgata called Vigataśoka.

source: འཇིག་རྟེན་གྱི་ཁམས་འཇིགས་པ་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་མཛད་པ་ཞེས་བྱ་བ་དང་།
en: In the world system called Fearless abides the Tathāgata called Pacifier of All Fears.

source: འཇིག་རྟེན་གྱི་ཁམས་རྟོགས་པ་དང་བློ་གྲོས་སུ་ལྡན་པ་ན་དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བ་དང་།
en: In the world system called Endowed with Realization and Intelligence abides the Tathāgata called Purifier of All Rebirths.

source: འཇིག་རྟེན་གྱི་ཁམས་ངན་འགྲོ་དང་བྲལ་བ་ན་དེ་བཞིན་གཤེགས་པ་ངན་སོང་ཐམས་ཅད་ཞི་བར་མཛད་པ་ཞེས་བྱ་བ་དང་།
en: In the world system called Free from Negative Forms of Existence abides the Tathāgata called Pacifier of All Negative Forms of Existence.

source: འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་དང་།
en: In the world system called Vimalā abides the Tathāgata called He Whose Intelligence Has Been Completely Purified.

source: འཇིག་རྟེན་གྱི་ཁམས་དབང་པོ་ན་དེ་བཞིན་གཤེགས་པ་དབང་པོའི་བློ་གྲོས་ཞེས་བྱ་བ་ཡོད་དེ
en: In the world system called Possessed of Power abides the Tathāgata called Powerful Intelligence.

source: དེའི་མཚན་བཟུང་བ་ཉིད་ཀྱིས་ལྷའི་དབང་པོར་འགྱུར་རོ། །
en: By calling them by their names, one will become the lord of the gods.

source: འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་རྒྱས་པ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “In the world system called Moon abides the Tathāgata called Stainless Full Moon.

source: དེའི་མཚན་བཟུང་ཞིང་མཆོད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །
en: By calling him by his name and worshipping him, one will be completely liberated from all defilements.

source: འཇིག་རྟེན་གྱི་ཁམས་ཁྱད་པར་ཐོབ་པ་ན་དེ་བཞིན་གཤེགས་པ་ངན་འགྲོ་ཐམས་ཅད་ཞི་བར་མཛད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the world system called Excellent Attainment abides the Tathāgata called Pacifier of All Negative Forms of Existence.

source: དེའི་མཚན་བཟུང་ཞིང་མཆོད་པས་ངན་འགྲོ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ། །
en: By calling him by his name and worshipping him, one will be liberated from negative forms of existence.

source: འཇིག་རྟེན་གྱི་ཁམས་ལེགས་པར་སྣང་བ་ན་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་སྡུག་པར་མཐོང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In the world system called Perfect Light abides the Tathāgata called He Who Looks at All Beings with Love.

source: དེའི་མཚན་བཟུང་ཞིང་མཆོད་པས་འཇིག་རྟེན་པ་ཐམས་ཅད་མངོན་པར་དགའ་བར་འགྱུར་རོ། །
en: By calling him by his name and worshipping him, all worldly beings will be completely delighted.

source: རིགས་ཀྱི་བུ་མདོར་ན་དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དཔལ་དང་། དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་དཔལ་དང་། དེ་བཞིན་གཤེགས་པ་དཔའ་བོ་དང་། དེ་བཞིན་གཤེགས་པ་བདུད་ཐམས་ཅད་ཀྱི་སྟོབས་རབ་ཏུ་འཇོམས་པ་དང་། དེ་བཞིན་གཤེགས་པ་གཙུག་པུད་ཅན་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱོབ་དང་། དེ་བཞིན་གཤེགས་པ་ལོག་པར་དད་སེལ་དང་། དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་དེ་དག་མྱ་ངན་ལས་འདས་ནས་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལོན་པའམ། མྱ་ངན་ལས་འདས་ནས་བསྐལ་པ་བརྒྱ་ལོན་པའི་
en: “Son of noble family, in a word, even if a sextillion years or a hundred eons have passed since the tathāgatas Ānandaśrī, Candanaśrī, Hero, Subjugator of All Demon Forces, Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, and Kāśyapa have manifested nirvāṇa, great king,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཚན་བཟུང་བ་དང་། རིང་བསྲེལ་གྱི་མཆོད་རྟེན་བྱེད་དུ་འཇུག་པ་དང་། རི་མོ་དང་སྐུ་གཟུགས་བྱེད་དུ་འཇུག་པ་དང་། མར་མེ་དང་། སྤོས་དང་། མེ་ཏོག་དང་། དྲི་དང་བྱུག་པ་རྣམས་ཀྱིས་མཆོད་ཅིང་བཀུར་སྟི་བྱས་པ་དང་། བསླབ་པ་འཛིན་དང་། བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་དང་། སྡོམ་པ་དང་། ཉེ་བར་གནས་པ་རྣམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ངན་སོང་དང་། ངན་འགྲོ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་རོ། །
en: all beings will be liberated from negative rebirths and negative forms of existence by calling the names of these buddhas; by having relic stūpas, drawings, and representations made; by worshipping and honoring them with lamps, incense, flowers, and perfume; and by maintaining the training, way of life, austerities, discipline, and fasting.

source: བསྐལ་པར་གནས་པའི་ལས་ཀྱི་སྒྲིབ་པ་མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ་ཡང་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ།
en: “Karmic obscurations that remain for eons, such as those stemming from the five actions with immediate results, will be purified.

source: བདེ་འགྲོར་འགྲོ་བར་འགྱུར་ཞིང་ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར་བ་ནས།
en: One will pass to pleasant forms of existence and not to negative ones, and

source: རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: one will gradually, fully, and completely awaken to unsurpassable, complete, and perfect awakening.

source: གལ་ཏེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དད་པ་དང་བྱང་ཆུབ་ཀྱི་སེམས་དྲན་པ་ཉམས་པ་ཞིག་གིས་སྡིག་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་དག་ལ་སྐུར་པ་འདེབས་པ་དང་། མཚམས་མེད་པ་ལྔ་བྱེད་པ་དང་། སྲོག་གཅོད་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་ནོར་རྐུ་བ་དང་། སེམས་ཅན་དམྱལ་བ་མནར་མེད་པར་འགྲོ་བ་དང་། ངན་སོང་གསུམ་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། གྲོགས་པོ་དང་གཉེན་རྣམས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་རི་མོའི་སྐུ་གཟུགས་དང་། འཇིམ་པའི་སྐུ་གཟུགས་བྱེད་དུ་འཇུག་ཅིང་། བྱེད་དུ་བཅུག་ནས་
en: “Suppose that sons or daughters of noble family with a feeble recollection of faith and bodhicitta commission drawings or clay statues of those tathāgatas. Suppose they do so to liberate friends and relatives, and for the sake of beings who engage in negative actions, abandon the noble Dharma, denigrate the noble ones, commit the five actions with immediate results, take a life, steal the wealth of the Three Jewels, go to the Avīci hell, or take birth in the three negative forms of existence. And suppose that once they have commissioned the drawings or statues,

source: ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་བའི་སེམས་གཙོ་བོར་བྱས་ཏེ
en: they focus principally on generating compassion toward all these beings and

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་ལྡན་པར་གྱུར་ནས་
en: adopt the noble eightfold path.

source: ཟླ་བ་ཡར་གྱི་ཚེས་བརྒྱད་ནས་བརྩམས་ཏེ་བཅོ་ལྔའི་བར་དུ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མེ་ཏོག་དང་། སྤོས་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མར་མེ་དང་། སིལ་སྙན་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་མཚན་ལན་གསུམ་ཉིན་ལན་གསུམ་དུ་མཆོད་དེ
en: And then suppose they worship the tathāgatas three times in the night and three times in the day with flowers, incense, perfume, garlands, salves, lamps, cymbals, royal banners, and flags, from the eighth day of the waxing moon until the fifteenth.

source: སེམས་ཅན་དེ་དག་ཐར་པར་བྱ་བའི་ཕྱིར་ཅི་ནས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་ནི་མཁྱེན།
en: “Now, in order to liberate beings, the buddhas, the blessed ones, know with their tathāgatas’ gnosis,

source: ལྷའི་སྙན་གྱིས་ནི་གསན།
en: hear with their divine ear,

source: ལྷའི་སྤྱན་གྱིས་ནི་གཟིགས་ཤིང་
en: and see with their divine eye,

source: སེམས་ཅན་དེ་དག་བདེ་འགྲོར་འགྲོ་བར་འགྱུར་གྱི་ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར་བ་དང་། ལེགས་པར་བྱ་བ་བྱེད་ཀྱི་ངན་པར་བྱ་བ་མི་བྱེད་པར་ཡོངས་སུ་བསྔོ་ཞིང་། དེ་ལྟར་སེམས་ཅན་ངན་སོང་དུ་སྐྱེས་པ་དེ་དག་ཐར་པར་བགྱི་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་གསོལ་བ་གདབ་བོ། །
en: [so when sons or daughters of noble family] dedicate their merit so that such beings will pass to pleasant forms of existence and accomplish wholesome deeds instead of negative ones, in order to liberate the beings born in negative forms of existence, they should supplicate the tathāgatas.

source: བཤགས་པ་དང་མཐོལ་བས་སྡིག་པ་བསྲབས་པར་གྱུར་ཅིག །
en: ‘May negative actions be attenuated through confessing and acknowledging faults!

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་པར་གྱུར་ཅིག །
en: May the names of the tathāgatas be heard!

source: ངན་འགྲོ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་གྱུར་ཅིག །
en: May beings be liberated from all negative forms of existence!

source: ཇི་སྲིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་བདག་གི་སྤྱོད་པ་དང་འཐུན་པར་སྤྱོད་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: Until they fully and perfectly awaken to unsurpassable, complete, and perfect awakening, may their conduct be in accordance with that of Mañjuśrī himself!’ They should dedicate their merit in this way:

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་བྲིས་པ་དང་། འདྲིར་བཅུག་པ་དང་། བཅངས་པ་དང་། བཀླག་པ་དང་། མཆོད་པ་དེའི་ཕྱིར་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྨོན་ལམ་གྱི་མཐུས་སེམས་ཅན་མནར་མེད་པར་འགྲོ་བ་དང་། ངན་སོང་གསུམ་དུ་སྐྱེས་པ་དེ་དག་གི་རྣ་བར་མཚན་རྣམས་ཐོས་པར་འགྱུར་རོ། །
en: “Moreover, if one copies the different teachings of the Dharma or commissions this activity, keeps them in mind, recites them, and worships them, then due to the power of the aspiration of the past tathāgatas, the names of the buddhas will reach the ears of beings born in Avīci hell and in the three negative forms of existence.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མཐུས་ཀྱང་སྡིག་པ་ཐམས་ཅད་བསྲབས་པར་འགྱུར་རོ། །
en: “In addition, through the power of these different methods of the Dharma, all negative actions will be attenuated.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་གཟི་བརྗིད་ཀྱི་མཐུ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མཐུས་དགེ་བ་དང་མི་དགེ་བའི་ལས་རྗེས་སུ་དྲན་པར་གྱུར་ནས་
en: Through the power of the tathāgatas’ majesty and their various Dharma discourses, one will be aware of wholesome and unwholesome actions.

source: ཕྱིས་སྡིག་པའི་ལས་བྱེད་པར་མི་འགྱུར་ཏེ
en: Thus one will subsequently not commit negative actions.

source: དེ་ནས་སྡུག་བསྔལ་དེ་དག་ལས་ཡོངས་སུ་གྲོལ་བར་འགྱུར་ཞིང་བདེ་འགྲོར་འགྲོ་བར་འགྱུར་རོ། །
en: One will then be liberated from the various kinds of suffering and pass to pleasant rebirths.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་སྤྱོད་པ་འཐུན་པར་འགྱུར་རོ། །
en: Until one reaches unsurpassable, complete, and perfect awakening, the state of truly perfect awakening, one’s actions will be conducive to it.

source: དེ་ལྟ་བས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཡོན་ཏན་མང་པོ་དང་ལྡན་ཞིང་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་འདྲ་སྟེ།
en: “Thus, these Dharma discourses are endowed with many positive properties. They are like the great maṇi jewel.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་བཞིན་དུ་བསམ་པ་ཐམས་ཅད་འགྲུབ་སྟེ།
en: Just like the great maṇi jewel, the wish-fulfilling jewel, they accomplish all wishes.

source: སྡིག་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད།
en: All negative actions are subjugated.

source: ངན་འགྲོའི་སྒོ་ཐམས་ཅད་གཅོད་པར་བྱེད་བདེ་འགྲོའི་སྒོ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་སྒོ་རྣམས་ནི་འབྱེད་དོ། །
en: All gates to the negative forms of existence are closed. All gates to the pleasant forms of existence and the buddhas’ realms are opened.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐབས་མཁས་པ་དང་། སྨོན་ལམ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། བྱིན་གྱི་རླབས་དང་། ཏིང་ངེ་འཛིན་སྣ་ཚོགས་པས་མྱ་ངན་ལས་འདས་ནས་བསྐལ་པ་བརྒྱ་ལོན་པ་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ན་གནས་པ་དག་མཉན་ཅིང་མཆོད་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཉིད་ཀྱིས་ངན་སོང་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་ཏེ་བདེ་འགྲོར་བཀོད་པར་འགྱུར་ན
en: “So, son of noble family, owing to the tathāgatas’ various skillful means, aspirations, extraordinary transformations, sovereign power, and states of concentration, one will pass to pleasant forms of existence and be liberated from all negative ones by continuously listening to and worshipping those who have remained in the various world systems, even if a hundred eons have passed since the tathāgatas’ nirvāṇa.

source: གང་འཆང་བ་དང་། ཀློག་པ་དང་། འདྲི་བ་དང་། འདྲིར་གཞུག་པ་དང་། གཞན་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: Therefore, what need is there to mention the importance of keeping in mind the Dharma, reading it, copying it or commissioning this action, or accurately teaching it in a detailed way to others?

source: ཡོན་ཏན་དེ་དག་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་ཡོངས་སུ་བཟུང་བར་འགྱུར་ན།
en: Suppose a son or daughter of noble family comes to possess this excellent quality.

source: དེའི་བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བའི་ཡོན་ཏན་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་བརྗོད་པར་སླ་བ་མ་ཡིན་ནོ། །
en: Except for the tathāgatas, no one could easily express the excellent quality of that being’s accumulation of merit and of his or her roots of virtue.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་ཡོན་ཏན་འདི་དག་ལ་ལྟོས་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཅང་བར་བྱའོ། །
en: “Great king, you should thus rely on this excellent quality and keep in mind the various Dharma discourses.

source: བཀླག་པར་བྱའོ། །
en: You should read them.

source: བཤད་པར་བྱའོ། །
en: You should explain them.

source: མཆོད་པར་བྱའོ། །
en: You should worship them.

source: དཀོན་མཆོག་གསུམ་ལ་དད་པ་མི་ཕྱེད་པར་བྱའོ། །
en: You should make your faith in the Three Jewels integral to you.

source: དེ་བཞིན་གཤེགས་པ་ལ་རྟག་ཏུ་མཆོད་ཅིང་བསྙེན་བཀུར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཡང་དག་པར་གཟུང་བར་བྱའོ། །
en: You should always worship and venerate the tathāgatas and correctly grasp their teachings.

source: འཁོར་བ་ལས་ཡིད་སྐྱོ་ཞིང་བག་ཡོད་པ་དང་། འཁོར་བ་སྐད་ཅིག་མར་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པར་བྱའོ། །
en: Being repulsed by saṃsāra, you should be vigilant and focus your thoughts on its momentariness.

source: ཡང་རྒྱལ་པོ་ཆེན་པོ་འདོད་པ་ལ་བསྟེན་པས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མར་སྡུག་བསྔལ་བ། སྐྱེ་བ་དང་འགག་པའི་སྡུག་བསྔལ་དང་། མངལ་ན་གནས་པའི་སྡུག་བསྔལ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་དང་། དབུལ་བའི་སྡུག་བསྔལ་དང་། གཅད་པ་དང་། གཞོམ་པ་དང་། བརྡུང་བ་དང་། བརྡེག་པ་དང་། བསྲེག་པའི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་ཏེ
en: Moreover, great king, the pursuit of their desires keeps beings in a state of suffering for sextillions of eons. That is, they will experience the suffering of arising and cessation, the suffering of being in the womb, the suffering of rebirth as a hell being or an animal, or the suffering of the world of Yama, the suffering of poverty, and the suffering of being cut, bruised, beaten, struck, and burnt.

source: འདུ་བྱེད་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ཏེ།
en: [Therefore, you should proceed to] abandon all conditioned phenomena.

source: འགྲོ་དགོས་པས་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྙིང་བརྩེ་བ་གཙོ་བོར་བྱ་བ་དང་། ཆོས་དང་ཐར་པ་འདོད་པར་བྱའོ། །
en: Therefore, you should proceed [to abandon all conditioned phenomena]. Great king, you should give priority to compassion and long for the Dharma and liberation.”

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་འཇམ་དཔལ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ།
en: King Prasenajit, together with his entire retinue, said to Mañjuśrī, “[Mañjuśrī,] this is excellent, [most excellent!]

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །
en: “Mañjuśrī, this is excellent, most excellent!

source: ཆོས་ཀྱི་ཆར་ཕབ་པས་བདག་ཅག་ཚིམ་པར་བགྱིས་རངས་པར་བགྱིས།
en: By bringing down the rain of the Dharma, you have made us content and happy.

source: བྱང་ཆུབ་ལ་རབ་ཏུ་བཞག་པས་བག་ཡོད་པར་བགྱིས་སོ། །
en: As we have set out upon the state of awakening, you have made us vigilant.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྟད་མོ་ཅན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: An eager bodhisattva then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། ཀློག་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་དང་། འདྲི་བ་དང་། འདྲིར་འཇུག་པ་དང་། འདྲི་བ་པོ་དང་། འཆང་བ་པོ་དང་། ཀློག་པ་པོ་དེ་དག་ལ་མེ་ཏོག་དང་། སྤོས་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གོས་དང་། རྒྱན་རྣམས་ཀྱིས་མཆོད་ན་
en: “Blessed One, suppose someone adopts the various teachings of the Dharma, reads them, teaches them in detail to others, copies them or commissions their copying, and honors those who copy, adopt, and recite the teachings with flowers, incense, perfume, garlands, salves, garments, and ornaments.

source: བཅོམ་ལྡན་འདས་དེའི་བསོད་ནམས་ཇི་སྙེད་ཅིག་སྐྱེ་བར་འགྱུར།
en: How much would the merit of this person increase, Blessed One?”

source: གང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོའམ། བློན་པོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ལ་ལ་ཞིག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པ་ལ་དད་པས་བཅངས་པ་དང་། མཆོད་པ་དང་། འདྲི་བ་དང་། འདྲིར་འཇུག་པ་དང་། ཡང་དག་པར་བསྟན་ན་
en: “If sons or daughters of noble family, kings, ministers, monks, nuns, male lay vow holders, or female lay vow holders keep in mind the various teachings of the Dharma with faith in the Tathāgata, worship them, copy them or commission their copying, and teach them correctly,

source: དེས་ཡོན་ཏན་ཆེན་པོ་བརྒྱད་ཐོབ་པར་འགྱུར་ཏེ
en: they will attain the eight great qualities.

source: བརྒྱད་གང་ཞེ་ན།
en: What are those eight great qualities?

source: གང་དག་འཇིག་རྟེན་ན་ནད་དང་གནོད་པ་དེ་དག་དེ་ལ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་འབྱུང་བ་དང་།
en: None of the diseases or harm in the world will affect them at all.

source: གང་འཇིག་རྟེན་ན་གནོད་སྦྱིན་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་མདངས་འཕྲོག་པ་དེ་དག་ཐམས་ཅད་བྱམས་པ་ལ་གནས་པར་འགྱུར་བ་དང་།
en: All yakṣas, bhūtas, and piśācas who rob people of their radiance will abide in loving-kindness.

source: གང་དག་གཤེད་བྱེད་དང་། བྱད་དང་། སྔགས་དང་། རོ་ལངས་གཞན་གྱི་གནོད་པ་དེ་དག་དེའི་ལུས་ལ་གནོད་པར་མི་འགྱུར་བ་དང་།
en: No harmful influences from kṛtyās, kākhordas, spell-casters, or vetālas will injure their body.

source: རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཐམས་ཅད་དེ་ལ་དགའ་ཞིང་མགུ་བར་གྱུར་ནས་
en: Having pleased all the kings, ministers, brahmins, householders, monks, nuns, and male and female lay vow holders,

source: དེའི་དོན་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་བ་དང་།
en: they will accomplish all aims.

source: ལྷ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་བར་འགྱུར་བ་དང་།
en: All the gods will congregate before them.
